-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: covermanage
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `config`
--

DROP TABLE IF EXISTS `config`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `config` (
  `cid` int DEFAULT NULL,
  `name` varchar(30) DEFAULT NULL COMMENT '名字',
  `standard` decimal(6,2) DEFAULT NULL COMMENT '标准值',
  `rangess` decimal(6,2) DEFAULT NULL COMMENT '波动范围',
  `unit` varchar(10) DEFAULT NULL COMMENT '单位'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `config`
--

/*!40000 ALTER TABLE `config` DISABLE KEYS */;
INSERT INTO `config` VALUES (1,'水温',12.00,15.00,'度'),(2,'ph值',4.50,2.00,' '),(3,'溶氧量',6.50,3.00,'mg/L'),(4,'盐度',0.10,0.04,'%'),(5,'水位标准值',65.00,15.00,'cm'),(6,'硫化氢标准值',1.09,0.10,NULL),(7,'甲烷标准值',0.35,0.20,NULL),(8,'倾斜角度',0.00,45.00,'度'),(9,'井内温度',10.00,10.00,'度');
/*!40000 ALTER TABLE `config` ENABLE KEYS */;

--
-- Table structure for table `cover`
--

DROP TABLE IF EXISTS `cover`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cover` (
  `cid` varchar(10) NOT NULL,
  `water_level` decimal(5,2) DEFAULT '0.00' COMMENT '水位 单位cm',
  `H2S` decimal(6,3) DEFAULT '0.000' COMMENT '硫化氢 单位%',
  `CH4` decimal(6,3) DEFAULT '0.000' COMMENT '甲烷 单位%',
  `inclination` decimal(4,2) DEFAULT '0.00' COMMENT '倾角',
  `temperature` decimal(6,2) DEFAULT '0.00' COMMENT '温度 单位摄氏度',
  `GPS-EW` int DEFAULT NULL COMMENT '经度',
  `GPS-NS` int DEFAULT NULL COMMENT '纬度',
  `man` varchar(20) DEFAULT NULL COMMENT '负责人',
  `address` varchar(50) DEFAULT NULL COMMENT '所属地区',
  PRIMARY KEY (`cid`),
  UNIQUE KEY `cover_cid_uindex` (`cid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cover`
--

/*!40000 ALTER TABLE `cover` DISABLE KEYS */;
INSERT INTO `cover` VALUES ('1',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('10',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('12',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('13',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('14',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('15',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('16',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('2',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('3',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('4',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('5',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('6',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('7',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区'),('8',13.90,12.600,16.000,4.20,32.00,122,123,'李四','襄阳市襄城区'),('9',14.90,12.800,13.000,7.00,12.00,121,122,'张三','襄阳市襄城区');
/*!40000 ALTER TABLE `cover` ENABLE KEYS */;

--
-- Table structure for table `log`
--

DROP TABLE IF EXISTS `log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `log` (
  `lid` int NOT NULL AUTO_INCREMENT,
  `man` varchar(20) DEFAULT NULL COMMENT '负责人',
  `cid` int DEFAULT NULL COMMENT '井的id',
  `msg` varchar(20) DEFAULT NULL COMMENT '报警信息',
  `send_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '报警时间',
  `state` tinyint(1) DEFAULT '0' COMMENT '是否处理',
  PRIMARY KEY (`lid`)
) ENGINE=InnoDB AUTO_INCREMENT=151 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `log`
--

/*!40000 ALTER TABLE `log` DISABLE KEYS */;
INSERT INTO `log` VALUES (1,'测试0002',1,'硫化氢含量过高','2023-05-08 21:58:35',1),(2,'测试0002',1,'甲烷含量过高','2023-05-08 21:58:35',1),(3,'测试0002',1,'水位过低','2023-05-08 21:58:35',1),(4,'测试0002',1,'倾斜角度异常','2023-05-08 21:58:35',1),(5,'测试0002',1,'井内温度过低','2023-05-08 21:58:35',1),(6,'测试0002',10,'硫化氢含量过高','2023-05-08 21:58:35',1),(76,'测试0002',1,'硫化氢含量过高','2023-05-08 22:01:06',1),(77,'测试0002',1,'甲烷含量过高','2023-05-08 22:01:06',1),(78,'测试0002',1,'水位过低','2023-05-08 22:01:06',0),(79,'测试0002',1,'倾斜角度异常','2023-05-08 22:01:06',0),(80,'测试0002',1,'井内温度过低','2023-05-08 22:01:06',0),(81,'测试0002',10,'硫化氢含量过高','2023-05-08 22:01:06',0),(82,'测试0002',10,'甲烷含量过高','2023-05-08 22:01:06',0),(83,'测试0002',10,'水位过低','2023-05-08 22:01:06',0),(84,'测试0002',10,'倾斜角度异常','2023-05-08 22:01:06',0),(85,'测试0002',10,'井内温度过低','2023-05-08 22:01:06',0),(86,'测试0002',12,'硫化氢含量过高','2023-05-08 22:01:06',0),(87,'测试0002',12,'甲烷含量过高','2023-05-08 22:01:06',0),(88,'测试0002',12,'水位过低','2023-05-08 22:01:06',0),(89,'测试0002',12,'倾斜角度异常','2023-05-08 22:01:06',0),(90,'测试0002',12,'井内温度过低','2023-05-08 22:01:06',0),(91,'测试0002',13,'硫化氢含量过高','2023-05-08 22:01:06',0),(92,'测试0002',13,'甲烷含量过高','2023-05-08 22:01:06',0),(93,'测试0002',13,'水位过低','2023-05-08 22:01:06',0),(94,'测试0002',13,'倾斜角度异常','2023-05-08 22:01:06',0),(95,'测试0002',13,'井内温度过低','2023-05-08 22:01:06',0),(96,'测试0002',14,'硫化氢含量过高','2023-05-08 22:01:06',0),(97,'测试0002',14,'甲烷含量过高','2023-05-08 22:01:06',0),(98,'测试0002',14,'水位过低','2023-05-08 22:01:06',0),(99,'测试0002',14,'倾斜角度异常','2023-05-08 22:01:06',0),(100,'测试0002',14,'井内温度过低','2023-05-08 22:01:06',0),(101,'测试0002',15,'硫化氢含量过高','2023-05-08 22:01:06',0),(102,'测试0002',15,'甲烷含量过高','2023-05-08 22:01:06',0),(103,'测试0002',15,'水位过低','2023-05-08 22:01:06',0),(104,'测试0002',15,'倾斜角度异常','2023-05-08 22:01:06',0),(105,'测试0002',15,'井内温度过低','2023-05-08 22:01:06',0),(106,'测试0002',16,'硫化氢含量过高','2023-05-08 22:01:06',0),(107,'测试0002',16,'甲烷含量过高','2023-05-08 22:01:06',0),(108,'测试0002',16,'水位过低','2023-05-08 22:01:06',0),(109,'测试0002',16,'倾斜角度异常','2023-05-08 22:01:06',0),(110,'测试0002',16,'井内温度过低','2023-05-08 22:01:06',0),(111,'测试0002',2,'硫化氢含量过高','2023-05-08 22:01:06',0),(112,'测试0002',2,'甲烷含量过高','2023-05-08 22:01:06',0),(113,'测试0002',2,'水位过低','2023-05-08 22:01:06',0),(114,'测试0002',2,'倾斜角度异常','2023-05-08 22:01:06',0),(115,'测试0002',2,'井内温度过低','2023-05-08 22:01:06',0),(116,'测试0002',3,'硫化氢含量过高','2023-05-08 22:01:06',0),(117,'测试0002',3,'甲烷含量过高','2023-05-08 22:01:06',0),(118,'测试0002',3,'水位过低','2023-05-08 22:01:06',0),(119,'测试0002',3,'倾斜角度异常','2023-05-08 22:01:06',0),(120,'测试0002',3,'井内温度过低','2023-05-08 22:01:06',0),(121,'测试0002',4,'硫化氢含量过高','2023-05-08 22:01:06',0),(122,'测试0002',4,'甲烷含量过高','2023-05-08 22:01:06',0),(123,'测试0002',4,'水位过低','2023-05-08 22:01:06',0),(124,'测试0002',4,'倾斜角度异常','2023-05-08 22:01:06',0),(125,'测试0002',4,'井内温度过低','2023-05-08 22:01:06',0),(126,'测试0002',5,'硫化氢含量过高','2023-05-08 22:01:06',0),(127,'测试0002',5,'甲烷含量过高','2023-05-08 22:01:06',0),(128,'测试0002',5,'水位过低','2023-05-08 22:01:06',0),(129,'测试0002',5,'倾斜角度异常','2023-05-08 22:01:06',0),(130,'测试0002',5,'井内温度过低','2023-05-08 22:01:06',0),(131,'测试0002',6,'硫化氢含量过高','2023-05-08 22:01:06',0),(132,'测试0002',6,'甲烷含量过高','2023-05-08 22:01:06',0),(133,'测试0002',6,'水位过低','2023-05-08 22:01:06',0),(134,'测试0002',6,'倾斜角度异常','2023-05-08 22:01:06',0),(135,'测试0002',6,'井内温度过低','2023-05-08 22:01:06',0),(136,'测试0002',7,'硫化氢含量过高','2023-05-08 22:01:06',0),(137,'测试0002',7,'甲烷含量过高','2023-05-08 22:01:06',0),(138,'测试0002',7,'水位过低','2023-05-08 22:01:06',0),(139,'测试0002',7,'倾斜角度异常','2023-05-08 22:01:06',0),(140,'测试0002',7,'井内温度过低','2023-05-08 22:01:06',0),(141,'测试0002',8,'硫化氢含量过高','2023-05-08 22:01:06',0),(142,'测试0002',8,'甲烷含量过高','2023-05-08 22:01:06',0),(143,'测试0002',8,'水位过低','2023-05-08 22:01:06',0),(144,'测试0002',8,'倾斜角度异常','2023-05-08 22:01:06',0),(145,'测试0002',8,'井内温度过低','2023-05-08 22:01:06',0),(146,'测试0002',9,'硫化氢含量过高','2023-05-08 22:01:06',0),(147,'测试0002',9,'甲烷含量过高','2023-05-08 22:01:06',0),(148,'测试0002',9,'水位过低','2023-05-08 22:01:06',0),(149,'测试0002',9,'倾斜角度异常','2023-05-08 22:01:06',0),(150,'测试0002',9,'井内温度过低','2023-05-08 22:01:06',0);
/*!40000 ALTER TABLE `log` ENABLE KEYS */;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `uid` int NOT NULL,
  `username` varchar(30) DEFAULT NULL,
  `password` varchar(30) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `authority` int DEFAULT NULL COMMENT '权限',
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (10001,'小王','123','123',1),(10002,'小陈','123','124',1),(10003,'小罗','123','125',2),(10004,'小绿','123','126',3),(10005,'陈龙','123','127',1),(10006,'下属','123','128',1),(10007,'郝宇','123','129',1),(10008,'呵呵','123','130',1),(10009,'沙雕','123','131',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-05-08 22:51:55
